app/Controllers/Admin/Bairros.php

    public function excluir($id = null){

        $bairro = $this->buscaBairroOu404($id);

        if($bairro->deletado_em != null ){
            return redirect()->back()->with('info',"O Bairro $bairro->nome já encontra-se excluído.");
        }


        if($this->request->getMethod() === 'post'){
            $this->bairroModel->delete($id);
---
UPDATE `bairros` SET `deletado_em` = '2023-11-18 11:47:13', `atualizado_em` = '2023-11-18 11:47:13'
WHERE `id` IN ('4')
AND `deletado_em` IS NULL

private function buscaBairroOu404(int $id = null){
    if(!$id || !$bairro = $this->bairroModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `bairros`
WHERE `id` = 4
GROUP BY `bairros`.`id`
ORDER BY `bairros`.`id` ASC
 LIMIT 1