app/Controllers/Admin/Extras.php

SELECT *
FROM `extras`
WHERE `id` = 1
 LIMIT 1
---
private function buscaExtraOu404(int $id = null){
    if(!$id || !$extra = $this->extraModel->withDeleted(true)->where('id', $id)->first()){