app/Controllers/Admin/Home.php

    public function index()
    {
        $data = [
            'titulo' => 'Home da Área Restrita',
            'valorPedidosEntregues' => $this->pedidoModel->valorPedidosEntregues(),
            'valorPedidosCancelados' => $this->pedidoModel->valorPedidosCancelados(),
            'totalClientesAtivos' => $this->usuarioModel->recuperaTotalClientesAtivos(),
            'totalEntregadoresAtivos' => $this->entregadorModel->recuperaTotalEntregadoresAtivos(),

        ];

        $novosPedidos = $this->pedidoModel->where('situacao', 0)->orderBy('criado_em', 'DESC')->findAll();
---
SELECT *
FROM `pedidos`
WHERE `situacao` = 0
ORDER BY `criado_em` DESC