app/Controllers/Admin/Medidas.php

    public function atualizar($id = null){
        if($this->request->getMethod() === 'post'){
            $medida = $this->buscaMedidaOu404($id);

            if($medida->deletado_em != null ){
                return redirect()->back()->with('info',"A medida $medida->nome encontra-se excluída. Não é possível atualizá-la.");
            }

            $medida->fill($this->request->getPost());

            if(!$medida->hasChanged()){

                return redirect()->back()->with('info', 'Nada foi alterado.');

            }


            if($this->medidaModel->save($medida)){
---
UPDATE `medidas` SET `ativo` = '1', `atualizado_em` = '2023-11-06 15:27:28'
WHERE `medidas`.`id` IN ('5')

private function buscaMedidaOu404(int $id = null){
    if(!$id || !$medida = $this->medidaModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `medidas`
WHERE `id` = 5
GROUP BY `medidas`.`id`
ORDER BY `medidas`.`id` ASC
 LIMIT 1