app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 4, 2
---
    public function index()
    {
        $data = [
            'titulo' => 'Listando os usuários',
            'usuarios' => $this->usuarioModel->findAll(),