app/Controllers/Checkout.php

        }

        $bairroRetornoSlug = mb_url_title($consulta->bairro, '-', true);
        $bairro = $this->bairroModel->select('nome, valor_entrega, slug')->where('slug', $bairroRetornoSlug)->where('ativo', true)->first();
---
SELECT `nome`, `valor_entrega`, `slug`
FROM `bairros`
WHERE `slug` = 'setor-sul'
AND `ativo` = 1
AND `bairros`.`deletado_em` IS NULL
 LIMIT 1

    public function processar(){
        if($this->request->getMethod() == 'post'){

            $checkoutPost = $this->request->getPost('checkout');

            $validacao = service('validation');

            $validacao->setRules([
                'checkout.rua' => ['label' => 'Endereço', 'rules' => 'required|max_length[50]'],
                'checkout.numero' => ['label' => 'Número', 'rules' => 'required|max_length[30]'],
                'checkout.referencia' => ['label' => 'Ponto de Referência', 'rules' => 'required|max_length[50]'],
                'checkout.forma_id' => ['label' => 'Forma de Pagamento', 'rules' => 'required|integer'],
                'checkout.bairro_slug' => ['label' => 'Consulte a Taxa de Entrega', 'rules' => 'required|string|max_length[30]'],
           ]);

            if(!$validacao->withRequest($this->request)->run()){

                session()->remove('endereco_entrega');
                return redirect()->back()->with('errors_model', $validacao->getErrors())->with('atencao', 'Por favor verifique os erros abaixo e tente novamente.');
            }

            $forma = $this->formaPagamentoModel->where('id', $checkoutPost['forma_id'])->where('ativo', true)->first();

            if($forma == null){

                session()->remove('endereco_entrega');
                return redirect()->back()->with('errors_model', $validacao->getErrors())->with('atencao', 'Por favor escolha a <strong>Forma de Pagamento </strong> e tente novamente');
            }

            $bairro = $this->bairroModel->where('slug', $checkoutPost['bairro_slug'])->where('ativo', true)->first();
---
SELECT *
FROM `bairros`
WHERE `slug` = 'setor-sul'
AND `ativo` = 1
AND `bairros`.`deletado_em` IS NULL
 LIMIT 1


            }

            $this->pedidoModel->save($pedido);
---
INSERT INTO `pedidos` (`usuario_id`, `codigo`, `forma_pagamento`, `produtos`, `valor_produtos`, `valor_entrega`, `valor_pedido`, `endereco_entrega`, `observacoes`, `criado_em`, `atualizado_em`) VALUES ('14', '09134909', 'Dinheiro', 'a:1:{i:0;a:6:{s:2:\"id\";s:1:\"1\";s:4:\"nome\";s:61:\"Chocolate com morango e MM Gigante Com extra Borda de Cheddar\";s:4:\"slug\";s:61:\"chocolate-com-morango-e-mm-gigante-com-extra-borda-de-cheddar\";s:5:\"preco\";s:5:\"55.00\";s:10:\"quantidade\";i:1;s:7:\"tamanho\";s:7:\"Gigante\";}}', '55.00', '5.00', '60.00', 'Setor Sul - Goianésia - Rua 25 - GO - CEP 76382-175</span> - Número 434', 'Ponto de Referência: ipiranga - Número: 434. Você informou que precisa de troco para: R$ 100,00', '2023-12-07 12:33:24', '2023-12-07 12:33:24')