app/Controllers/Password.php

    public function processaEsqueci(){

        if($this->request->getMethod() === 'post'){

            $usuario = $this->usuarioModel->buscaUsuarioPorEmail($this->request->getPost('email'));
            if($usuario === null || !$usuario->ativo){
                return redirect()->to(site_url('password/esqueci'))->with('atencao', 'Não encontramos uma conta válida com esse email.')->withInput();


            }

            $usuario->iniciaPasswordReset();

           $this->usuarioModel->save($usuario);
---
UPDATE `usuarios` SET `reset_hash` = '00c6a0eadbac7f9ebc3086b517ce98954828202f43ad7b9d16e94aae906dc1e5', `reset_expira_em` = '2023-11-05 14:38:26', `atualizado_em` = '2023-11-05 12:38:26'
WHERE `usuarios`.`id` IN ('8')