app/Controllers/Produto.php

    public function detalhes(string $produto_slug = null){

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo', true)->first()){
---
SELECT *
FROM `produtos`
WHERE `slug` = 'chocolate-com-morango-e-mm'
AND `ativo` = 1
AND `produtos`.`deletado_em` IS NULL
 LIMIT 1

    public function customizar(string $produto_slug = null){

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo', true)->first()){
---
SELECT *
FROM `produtos`
WHERE `slug` = 'chocolate-com-morango-e-mm'
AND `ativo` = 1
AND `produtos`.`deletado_em` IS NULL
 LIMIT 1