app/Models/PedidoModel.php

SELECT COUNT(*) AS total, SUM(`valor_pedido`) AS `valor_pedido`
FROM `pedidos`
WHERE `situacao` = 2
 LIMIT 1
---
    public function valorPedidosEntregues(){
        return $this->select('COUNT(*) AS total')
            ->selectSum('valor_pedido')
            ->where('situacao', 2)
            ->first();

SELECT COUNT(*) AS total, SUM(`valor_pedido`) AS `valor_pedido`
FROM `pedidos`
WHERE `situacao` = 3
 LIMIT 1
---
    public function valorPedidosCancelados(){
        return $this->select('COUNT(*) AS total')
            ->selectSum('valor_pedido')
            ->where('situacao', 3)
            ->first();